tests/fixtures/vcr_cassettes/payments/create.json

{
  "http_interactions": [
    {
      "recorded_at": "2017-05-15T10:49:50",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "login_id=development%40currencycloud.com&api_key=deadbeefdeadbeefdeadbeefdeadbeefdeadbeefdeadbeefdeadbeefdeadbeef"
        },
        "headers": {
          "Accept": "*/*",
          "Accept-Encoding": "gzip, deflate",
          "Connection": "keep-alive",
          "Content-Length": "116",
          "Content-Type": "application/x-www-form-urlencoded",
          "User-Agent": "CurrencyCloudSDK/2.0 Python/4.5.1"
        },
        "method": "POST",
        "uri": "https://devapi.currencycloud.com/v2/authenticate/api"
      },
      "response": {
        "body": {
          "base64_string": "H4sIAAAAAAAAA6pWSiwtyYgvyc9OzVOyUko1T0o0MzBISUlKM0lLNDQytTROtTA3T001S7Y0NTQ1VqoFAAAA//8DAIdYNOYxAAAA",
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "CF-RAY": "35f58861a97d357e-LHR",
          "Connection": "keep-alive",
          "Content-Encoding": "gzip",
          "Content-Type": "application/json;charset=utf-8",
          "Date": "Mon, 15 May 2017 10:49:50 GMT",
          "Server": "cloudflare-nginx",
          "Set-Cookie": "__cfduid=ddd9c5a9980caca36affe153464ad6ce91494845389; expires=Tue, 15-May-18 10:49:49 GMT; path=/; domain=.thecurrencycloud.com; HttpOnly",
          "Transfer-Encoding": "chunked",
          "Vary": "Origin",
          "X-Content-Type-Options": "nosniff",
          "X-Request-Id": "3316299952793766431"
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://devapi.currencycloud.com/v2/authenticate/api"
      }
    },
    {
      "recorded_at": "2017-05-15T10:49:51",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "reason=Testing+payments&currency=GBP&amount=1000&beneficiary_id=a0bd2d78-3621-4c29-932f-a39d6b34d5e7&reference=Testing+payments&payment_type=regular"
        },
        "headers": {
          "Accept": "*/*",
          "Accept-Encoding": "gzip, deflate",
          "Connection": "keep-alive",
          "Content-Length": "148",
          "Content-Type": "application/x-www-form-urlencoded",
          "Cookie": "__cfduid=ddd9c5a9980caca36affe153464ad6ce91494845389",
          "User-Agent": "CurrencyCloudSDK/2.0 Python/4.5.1",
          "X-Auth-Token": "e7ba600ddbf4fa12593e877ee6c95153"
        },
        "method": "POST",
        "uri": "https://devapi.currencycloud.com/v2/payments/create"
      },
      "response": {
        "body": {
          "base64_string": "H4sIAAAAAAAAA5ySP2/cMAzFv0rBtVYh2ZIteWyDZO2QXaAl+mLAkS76U+BQ9LsX8iXXGzoUXfmkx8cf+RM2DzNovix6QscmoQYmETXTvTFMoZkWZ5SWnkMH+BprKDCD4Jx/4a20UKB1cxumiz2skC++95Nmw9gLJl1vmBn6leFg/LgM0iuaoANXU6LgLjDD09fv0EGilVqFYIZnymULp09nvLxSKPmQMcfwdy0XLDXD3B75iy3RZgq+NUmEJSbrYijoyjWgGNWoeqmYWEbF5CiJ4boiU3oQgzD9ouQKHbz723I502F9qjumO8FjaULPxcS4YkJBByVhyCulRN5iA9Wg1fIS05axbDHYXOicbaK3uiVqcRrEHXOx9dwc/y9sfomp2HuEYuJKKPb07fHh4ZFz0WjE8INSbimad6j73sGK214T2Rvf64SUrv2dQS9X7Zg0cmFS48i0XgRbndODM0bqAW8/PBXc9mxzrOkIgc4dB/O+iQ8of5A9Cz5LMyvxmfP5uKcrhX94+LGGU4r1fDdQDdtbpYMw5XITfv0GAAD//wMAf7hISOoCAAA=",
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "CF-RAY": "35f5886afd67357e-LHR",
          "Connection": "keep-alive",
          "Content-Encoding": "gzip",
          "Content-Type": "application/json;charset=utf-8",
          "Date": "Mon, 15 May 2017 10:49:51 GMT",
          "Server": "cloudflare-nginx",
          "Transfer-Encoding": "chunked",
          "Vary": "Origin",
          "X-Content-Type-Options": "nosniff",
          "X-Request-Id": "3316299965366145574"
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://devapi.currencycloud.com/v2/payments/create"
      }
    }
  ],
  "recorded_with": "betamax/0.8.0"
}
