tests/fixtures/vcr_cassettes/payments/update.json

{
  "http_interactions": [
    {
      "recorded_at": "2017-05-15T10:49:56",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "login_id=development%40currencycloud.com&api_key=deadbeefdeadbeefdeadbeefdeadbeefdeadbeefdeadbeefdeadbeefdeadbeef"
        },
        "headers": {
          "Accept": "*/*",
          "Accept-Encoding": "gzip, deflate",
          "Connection": "keep-alive",
          "Content-Length": "116",
          "Content-Type": "application/x-www-form-urlencoded",
          "User-Agent": "CurrencyCloudSDK/2.0 Python/3.0.0"
        },
        "method": "POST",
        "uri": "https://devapi.currencycloud.com/v2/authenticate/api"
      },
      "response": {
        "body": {
          "base64_string": "H4sIAAAAAAAAA6pWSiwtyYgvyc9OzVOyUkpKNjAzNTFJSU4yM0kzSTS1NE4yMjZOSjUxNTdJSzEzUaoFAAAA//8DAPDpwK4xAAAA",
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "CF-RAY": "35f588864fa20a78-LHR",
          "Connection": "keep-alive",
          "Content-Encoding": "gzip",
          "Content-Type": "application/json;charset=utf-8",
          "Date": "Mon, 15 May 2017 10:49:56 GMT",
          "Server": "cloudflare-nginx",
          "Set-Cookie": "__cfduid=d6413b3858dd7d528a5dbc36ee95f5b0b1494845394; expires=Tue, 15-May-18 10:49:54 GMT; path=/; domain=.thecurrencycloud.com; HttpOnly",
          "Transfer-Encoding": "chunked",
          "Vary": "Origin",
          "X-Content-Type-Options": "nosniff",
          "X-Request-Id": "3316300001959356977"
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://devapi.currencycloud.com/v2/authenticate/api"
      }
    },
    {
      "recorded_at": "2017-05-15T10:49:56",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "Accept": "*/*",
          "Accept-Encoding": "gzip, deflate",
          "Connection": "keep-alive",
          "Cookie": "__cfduid=d6413b3858dd7d528a5dbc36ee95f5b0b1494845394",
          "User-Agent": "CurrencyCloudSDK/2.0 Python/3.0.0",
          "X-Auth-Token": "bc06544dcb64f4a593b233be4574fd64"
        },
        "method": "GET",
        "uri": "https://devapi.currencycloud.com/v2/payments/80bb87ac-7153-4aa8-8299-5a97bc9584d0"
      },
      "response": {
        "body": {
          "base64_string": "H4sIAAAAAAAAA5ySP2/cMAzFv0rBtVYh2ZIteUyDZO2QXaAl+mLAkS76U+BQ9LsX8vWuGToUXfmox8cf9QM2DzNovix6QscmoQYmETXTvTFMoZkWZ5SWnkMH+BZrKDCD4Jx/4a20UKB1cxumiz2skC++95Nmw9gLJl1vmBn6leFg/LgM0iuaoANXU6LgLjDD88M36CDRSq1CMMML5bKF06czXt4olHzImGP4u5YLlpphbk3+Yku0mYJvQxJhicm6GAq6cg0oRjWqXiomllExOUpiuK7IlB7EIEy/KLlCB7/9bbmc6bA+1R3TB8FjaULPxcS4YkJBByVhyCulRN5iA9Wg1fIa05axbDHYXOicbaL3uiVqcRrEHXOx9dwc/y9sfo2p2I8IxcSVUOz569Pj4xPnotGI4Tul3FI071D3vYMVt70msne+1w0pXec7g16u2jFp5MKkxpFpvQi2OqcHZ4zUA95feCq47dnmWNMR4ijf7nBD8gfYi+CzNLMSnzmfj990ZfAPjbcjnFKs5w/r1LC9Vzr4Ui534ecvAAAA//8DAN2etIDoAgAA",
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "CF-RAY": "35f5888f7b490a78-LHR",
          "Connection": "keep-alive",
          "Content-Encoding": "gzip",
          "Content-Type": "application/json;charset=utf-8",
          "Date": "Mon, 15 May 2017 10:49:56 GMT",
          "Server": "cloudflare-nginx",
          "Transfer-Encoding": "chunked",
          "Vary": "Origin",
          "X-Content-Type-Options": "nosniff",
          "X-Request-Id": "3316300014324206132"
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://devapi.currencycloud.com/v2/payments/80bb87ac-7153-4aa8-8299-5a97bc9584d0"
      }
    },
    {
      "recorded_at": "2017-05-15T10:49:57",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "amount=1200"
        },
        "headers": {
          "Accept": "*/*",
          "Accept-Encoding": "gzip, deflate",
          "Connection": "keep-alive",
          "Content-Length": "11",
          "Content-Type": "application/x-www-form-urlencoded",
          "Cookie": "__cfduid=d6413b3858dd7d528a5dbc36ee95f5b0b1494845394",
          "User-Agent": "CurrencyCloudSDK/2.0 Python/3.0.0",
          "X-Auth-Token": "bc06544dcb64f4a593b233be4574fd64"
        },
        "method": "POST",
        "uri": "https://devapi.currencycloud.com/v2/payments/80bb87ac-7153-4aa8-8299-5a97bc9584d0"
      },
      "response": {
        "body": {
          "base64_string": "H4sIAAAAAAAAA5ySP2/cMAzFv0rBtVYh2ZIteWyDZO2QXaAl+mLAkS76U+BQ9LsX8iXXG9qlKx/19Pgjf8LmYQbNl0VP6Ngk1MAkoma6N4YpNNPijNLSc+gAX2MNBWYQPedfeCstFGjd3IbpYg8r5Ivv/aTZMPaCSdcbZoZ+ZTgYPy6D9Iom6MDVlCi4C8zw9PU7dJBopVYhmOGZctnC6dMZL68USj5kzDH8XcsFS80wtyZ/sSXaTMG3TxJhicm6GAq6cg0oRjWqXiomllExOUpiuK7IlB7EIEy/KLlCB+/+tlzOdFif6o7pTvBYmtBzMTGumFDQQUkY8kopkbfYQDVotbzEtGUsWww2Fzpnm+itbolanAZxx1xsPTfH/wubX2Iq9h6hmLgSij19e3x4eORcNBox/KCUW4rmHeq+d7DittdE9sb3OiGl6//OoJerdkwauTCpcWRaL4KtzunBGSP1gLcXngpue7Y51nSEQOeOg3nfxAeUP8ieBZ+lmZX4zPl83NOVwj8bx1vjxxpOKdbz3UA1bG+VDsKUy0349RsAAP//AwBNYmbp6gIAAA==",
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "CF-RAY": "35f588906bac0a78-LHR",
          "Connection": "keep-alive",
          "Content-Encoding": "gzip",
          "Content-Type": "application/json;charset=utf-8",
          "Date": "Mon, 15 May 2017 10:49:57 GMT",
          "Server": "cloudflare-nginx",
          "Transfer-Encoding": "chunked",
          "Vary": "Origin",
          "X-Content-Type-Options": "nosniff",
          "X-Request-Id": "3316300015538498103"
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://devapi.currencycloud.com/v2/payments/80bb87ac-7153-4aa8-8299-5a97bc9584d0"
      }
    },
    {
      "recorded_at": "2017-05-15T10:49:57",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "Accept": "*/*",
          "Accept-Encoding": "gzip, deflate",
          "Connection": "keep-alive",
          "Cookie": "__cfduid=d6413b3858dd7d528a5dbc36ee95f5b0b1494845394",
          "User-Agent": "CurrencyCloudSDK/2.0 Python/3.0.0",
          "X-Auth-Token": "bc06544dcb64f4a593b233be4574fd64"
        },
        "method": "GET",
        "uri": "https://devapi.currencycloud.com/v2/payments/80bb87ac-7153-4aa8-8299-5a97bc9584d0"
      },
      "response": {
        "body": {
          "base64_string": "H4sIAAAAAAAAA5ySP2/cMAzFv0rBtVYh2ZIteUyDZO2QXaAl+mLAkS76U+BQ9LsX8vWuGdqlKx/1+PijfsDmYQbNl0VP6Ngk1MAkoma6N4YpNNPijNLSc+gA32INBWYQPedfeCstFGjd3IbpYg8r5Ivv/aTZMPaCSdcbZoZ+ZTgYPy6D9Iom6MDVlCi4C8zw/PANOki0UqsQzPBCuWzh9OmMlzcKJR8y5hj+ruWCpWaYW5O/2BJtpuDbkERYYrIuhoKuXAOKUY2ql4qJZVRMjpIYrisypQcxCNMvSq7QwW9/Wy5nOqxPdcf0QfBYmtBzMTGumFDQQUkY8kopkbfYQDVotbzGtGUsWww2Fzpnm+i9bolanAZxx1xsPTfH/wubX2Mq9iNCMXElFHv++vT4+MS5aDRi+E4ptxTNO9R972DFba+J7J3vdUNK1/nOoJerdkwauTCpcWRaL4KtzunBGSP1gPcXngpue7Y51nSEOMq3O9yQ/AH2IvgszazEZ87n4zddGfyzcbo33o5wSrGeP6xTw/Ze6eBLudyFn78AAAD//wMAChOa8+gCAAA=",
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "CF-RAY": "35f588953de70a78-LHR",
          "Connection": "keep-alive",
          "Content-Encoding": "gzip",
          "Content-Type": "application/json;charset=utf-8",
          "Date": "Mon, 15 May 2017 10:49:57 GMT",
          "Server": "cloudflare-nginx",
          "Transfer-Encoding": "chunked",
          "Vary": "Origin",
          "X-Content-Type-Options": "nosniff",
          "X-Request-Id": "3316300022117188151"
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://devapi.currencycloud.com/v2/payments/80bb87ac-7153-4aa8-8299-5a97bc9584d0"
      }
    }
  ],
  "recorded_with": "betamax/0.8.0"
}
